In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\peiyu\anaconda3\envs\peiyu_base\lib\site-packages (1.5.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\peiyu\anaconda3\envs\peiyu_base\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.20.3 in c:\users\peiyu\anaconda3\envs\peiyu_base\lib\site-packages (from pandas) (1.23.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\peiyu\anaconda3\envs\peiyu_base\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\peiyu\anaconda3\envs\peiyu_base\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [5]:
import pandas as pd

In [6]:
pd

In [7]:
hipandas = pd.Series([1,2,3,4,5])
print(hipandas)           #顯示Series
print(hipandas.values)    #顯示值
print(hipandas.index)     #顯示索引

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [10]:
dict1 = {'Taipei': '台北', 'Taichung': '台中', 'Kaohsiung': '高雄'}
city = pd.Series(dict1)
print(city)           #顯示Series
print(city.values)    #顯示值
print(city.index)     #顯示索引
print(city['Taipei']) #用索引取值

Taipei       台北
Taichung     台中
Kaohsiung    高雄
dtype: object
['台北' '台中' '高雄']
Index(['Taipei', 'Taichung', 'Kaohsiung'], dtype='object')
台北

In [12]:
print(city['Taichung':'Kaohsiung'])

Taichung     台中
Kaohsiung    高雄
dtype: object

In [16]:
hipandas[0]

1

In [18]:
hipandas[1]

2

In [19]:
hipandas[2]

3

In [26]:
se1 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

In [22]:
se1['a']

1

In [23]:
se1['b']

2

In [24]:
se1['c']

3

In [25]:
se1[1]

2

In [27]:
df = pd.DataFrame([[65,92,78,83,70], 
                   [90,72,76,93,56], 
                   [81,85,91,89,77], 
                   [79,53,47,94,80]])
df

    0   1   2   3   4
0  65  92  78  83  70
1  90  72  76  93  56
2  81  85  91  89  77
3  79  53  47  94  80

In [28]:
df1 = pd.DataFrame([[65,92,78,83,70], 
                   [90,72,76,93,56], 
                   [81,85,91,89,77], 
                   [79,53,47,94,80]],
                   index=['王小明','李小美','陳大同','林小玉'],
                   columns=['國文','英文','數學','自然','社會'])
df1

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  77
林小玉  79  53  47  94  80

In [29]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df2 = pd.DataFrame(scores)
df2

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [30]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df3 = pd.DataFrame({ '國文':se1,'英文':se2,'數學':se3,
                   '自然':se4,'社會':se5} )
df3

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [31]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df4 = pd.concat([se1,se2,se3,se4,se5], axis=1)
df4.columns=['國文','英文','數學','自然','社會']
df4

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [32]:
df4["自然"]

王小明    83
李小美    93
陳大同    89
林小玉    94
Name: 自然, dtype: int64

In [33]:
df4["數學"]

王小明    78
李小美    76
陳大同    91
林小玉    47
Name: 數學, dtype: int64

In [34]:
df4["社會"]

王小明    70
李小美    56
陳大同    94
林小玉    80
Name: 社會, dtype: int64

In [35]:
df4[["自然", "數學", "社會"]]

     自然  數學  社會
王小明  83  78  70
李小美  93  76  56
陳大同  89  91  94
林小玉  94  47  80

In [36]:
df4[df4["國文"] >= 80]

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94

In [37]:
df4[df4["數學"] >= 80]

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94

In [38]:
df4[df4["英文"] >= 90]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70

In [39]:
df4.values

array([[65, 92, 78, 83, 70],
       [90, 72, 76, 93, 56],
       [81, 85, 91, 89, 94],
       [79, 53, 47, 94, 80]], dtype=int64)

In [40]:
df4.values[1]

array([90, 72, 76, 93, 56], dtype=int64)

In [42]:
df4.values[1][2]

76

In [43]:
df4.values[3][4]

80

In [44]:
df4.loc["林小玉", "社會"]

80

In [45]:
df4.loc["王小明", ["國文","社會"]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [46]:
df4.loc[["王小明", "李小美"], ["數學", "自然"]]

     數學  自然
王小明  78  83
李小美  76  93

In [47]:
df4.loc["王小明":"陳大同", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [48]:
df4.loc["陳大同", :]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [49]:
df4.loc[:"李小美", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56

In [50]:
df4.loc["李小美":, "數學":"社會"]

     數學  自然  社會
李小美  76  93  56
陳大同  91  89  94
林小玉  47  94  80

In [51]:
df4.loc["林小玉", "社會"]

80

In [52]:
df4.loc["王小明", ["國文","社會"]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [53]:
df4.loc[["王小明", "李小美"], ["數學", "自然"]]

     數學  自然
王小明  78  83
李小美  76  93

In [54]:
df4.loc["王小明":"陳大同", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [55]:
df4.loc["陳大同", :]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [56]:
df4.loc[:"李小美", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56

In [57]:
df4.loc["李小美":, "數學":"社會"]

     數學  自然  社會
李小美  76  93  56
陳大同  91  89  94
林小玉  47  94  80